import streamlit as st

st.title('Пройдите психометрический тест')
st.subheader('Это займет примерно 5-7 минут')
sex = st.selectbox(
     'Ваш пол?',
     ('Мужской', 'Женский', 'Неуказан'))

age = st.number_input('Ваш возраст?',)

credit = st.selectbox(
     'Просрачивали ли вы кредит?',
     ('Да', 'Нет', 'Не знаю'))


q1 = st.selectbox(
     ' Я не очень много говорю.',                                                    
     ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен'))

if q1 == 'Пропустить':
    q1 = 0
elif q1 == 'Не согласен':
    q1 = 1
elif q1 == 'Скорее не согласен':
    q1 = 2
elif q1 == 'Не знаю':
    q1 = 3
elif q1 == 'Скорее согласен':
    q1 = 4
elif q1 == 'Согласен':
    q1 = 5


q2 = st.selectbox(
    ' У меня частые перепады настроения.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q2 == 'Пропустить':
    q2 = 0
elif q2 == 'Не согласен':
    q2 = 1
elif q2 == 'Скорее не согласен':
    q2 = 2
elif q2 == 'Не знаю':
    q2 = 3
elif q2 == 'Скорее согласен':
    q2 = 4
elif q2 == 'Согласен':
    q2 = 5


q3 = st.selectbox(
    'Я часто чувствую себя синим.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)


if q3 == 'Пропустить':
    q3 = 0
elif q3 == 'Не согласен':
    q3 = 1
elif q3 == 'Скорее не согласен':
    q3 = 2
elif q3 == 'Не знаю':
    q3 = 3
elif q3 == 'Скорее согласен':
    q3 = 4
elif q3 == 'Согласен':
    q3 = 5


q4 = st.selectbox(
    'Я всегда готов.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q4 == 'Пропустить':
    q4 = 0
elif q4 == 'Не согласен':
    q4 = 1
elif q4 == 'Скорее не согласен':
    q4 = 2
elif q4 == 'Не знаю':
    q4 = 3
elif q4 == 'Скорее согласен':
    q4 = 4
elif q4 == 'Согласен':
    q4 = 5


q5 = st.selectbox(
    'Я полон идей.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q5 == 'Пропустить':
    q5 = 0
elif q5 == 'Не согласен':
    q5 = 1
elif q5 == 'Скорее не согласен':
    q5 = 2
elif q5 == 'Не знаю':
    q5 = 3
elif q5 == 'Скорее согласен':
    q5 = 4
elif q5 == 'Согласен':
    q5 = 5


q6 = st.selectbox(
    'Я не против быть в центре внимания.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q6 == 'Пропустить':
    q6 = 0
elif q6 == 'Не согласен':
    q6 = 1
elif q6 == 'Скорее не согласен':
    q6 = 2
elif q6 == 'Не знаю':
    q6 = 3
elif q6 == 'Скорее согласен':
    q6 = 4
elif q6 == 'Согласен':
    q6 = 5


q7 = st.selectbox(
    'Я легко впадаю в стресс.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)


if q7 == 'Пропустить':
    q7 = 0
elif q7 == 'Не согласен':
    q7 = 1
elif q7 == 'Скорее не согласен':
    q7 = 2
elif q7 == 'Не знаю':
    q7 = 3
elif q7 == 'Скорее согласен':
    q7 = 4
elif q7 == 'Согласен':
    q7 = 5


q8 = st.selectbox(
    'Я легко расстраиваюсь.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q8 == 'Пропустить':
    q8 = 0
elif q8 == 'Не согласен':
    q8 = 1
elif q8 == 'Скорее не согласен':
    q8 = 2
elif q8 == 'Не знаю':
    q8 = 3
elif q8 == 'Скорее согласен':
    q8 = 4
elif q8 == 'Согласен':
    q8 = 5


q9 = st.selectbox(
    ' У меня отличные идеи.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)


if q9 == 'Пропустить':
    q9 = 0
elif q9 == 'Не согласен':
    q9 = 1
elif q9 == 'Скорее не согласен':
    q9 = 2
elif q9 == 'Не знаю':
    q9 = 3
elif q9 == 'Скорее согласен':
    q9 = 4
elif q9 == 'Согласен':
    q9 = 5



q10 = st.selectbox(
    'Я использую сложные слова.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q10 == 'Пропустить':
    q10 = 0
elif q10 == 'Не согласен':
    q10 = 1
elif q10 == 'Скорее не согласен':
    q10 = 2
elif q10 == 'Не знаю':
    q10 = 3
elif q10 == 'Скорее согласен':
    q10 = 4
elif q10 == 'Согласен':
    q10 = 5




q11 = st.selectbox(
    'У меня богатый словарный запас.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q11 == 'Пропустить':
    q11 = 0
elif q11 == 'Не согласен':
    q11 = 1
elif q11 == 'Скорее не согласен':
    q11 = 2
elif q11 == 'Не знаю':
    q11 = 3
elif q11 == 'Скорее согласен':
    q11 = 4
elif q11 == 'Согласен':
    q1 = 5


q12 = st.selectbox(
    ' Я мало забочусь о других.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q12 == 'Пропустить':
    q12 = 0
elif q12 == 'Не согласен':
    q12 = 1
elif q12 == 'Скорее не согласен':
    q12 = 2
elif q12 == 'Не знаю':
    q12 = 3
elif q12 == 'Скорее согласен':
    q12 = 4
elif q12 == 'Согласен':
    q12 = 5


q13 = st.selectbox(
    'Я не допускаю беспорядка в делах.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)


if q13 == 'Пропустить':
    q13 = 0
elif q13 == 'Не согласен':
    q13 = 1
elif q13 == 'Скорее не согласен':
    q13 = 2
elif q13 == 'Не знаю':
    q13 = 3
elif q13 == 'Скорее согласен':
    q13 = 4
elif q13 == 'Согласен':
    q13 = 5

q14 = st.selectbox(
    'Я уклоняюсь от своих обязанностей.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q14 == 'Пропустить':
    q14 = 0
elif q14 == 'Не согласен':
    q14 = 1
elif q14 == 'Скорее не согласен':
    q14 = 2
elif q14 == 'Не знаю':
    q14 = 3
elif q14 == 'Скорее согласен':
    q14 = 4
elif q14 == 'Согласен':
    q14 = 5



q15 = st.selectbox(
    'Я часто меняю свое настроение.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q15 == 'Пропустить':
    q15 = 0
elif q15 == 'Не согласен':
    q15 = 1
elif q15 == 'Скорее не согласен':
    q15 = 2
elif q15 == 'Не знаю':
    q15 = 3
elif q15 == 'Скорее согласен':
    q15 = 4
elif q15 == 'Согласен':
    q15 = 5




q16 = st.selectbox(
    'У меня частые перепады настроения.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)


if q16 == 'Пропустить':
    q16 = 0
elif q16 == 'Не согласен':
    q16 = 1
elif q16 == 'Скорее не согласен':
    q16 = 2
elif q16 == 'Не знаю':
    q16 = 3
elif q16 == 'Скорее согласен':
    q16 = 4
elif q16 == 'Согласен':
    q16 = 5


q17 = st.selectbox(
    'У меня не очень хорошее воображение.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)


if q17 == 'Пропустить':
    q17 = 0
elif q17 == 'Не согласен':
    q17 = 1
elif q17 == 'Скорее не согласен':
    q17 = 2
elif q17 == 'Не знаю':
    q17 = 3
elif q17 == 'Скорее согласен':
    q17 = 4
elif q17 == 'Согласен':
    q17 = 5


q18 = st.selectbox(
    'Я следую расписанию.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q18 == 'Пропустить':
    q18 = 0
elif q18 == 'Не согласен':
    q18 = 1
elif q18 == 'Скорее не согласен':
    q18 = 2
elif q18 == 'Не знаю':
    q18 = 3
elif q18 == 'Скорее согласен':
    q18 = 4
elif q18 == 'Согласен':
    q18 = 5


q19 = st.selectbox(
    'Большую часть времени я спокоен.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)


if q19 == 'Пропустить':
    q19 = 0
elif q19 == 'Не согласен':
    q19 = 1
elif q19 == 'Скорее не согласен':
    q19 = 2
elif q19 == 'Не знаю':
    q19 = 3
elif q19 == 'Скорее согласен':
    q19 = 4
elif q19 == 'Согласен':
    q19 = 5

q20 = st.selectbox(
    'Я молчу в окружении незнакомых людей.',
    ('Пропустить', 'Не согласен', 'Скорее не согласен', 'Не знаю', 'Скорее согласен','Согласен')
)

if q20 == 'Пропустить':
    q20 = 0
elif q20 == 'Не согласен':
    q20 = 1
elif q20 == 'Скорее не согласен':
    q20 = 2
elif q20 == 'Не знаю':
    q20 = 3
elif q20 == 'Скорее согласен':
    q20 = 4
elif q20 == 'Согласен':
    q20 = 5



score = q1 + q2 + q3 + q4 + q5 + q6 + q7 + q8 + q9 + q10 + q11 + q12 + q13 + q14 + q15 + q16 + q17 + q18 + q19 + q20

if score < 17:
    ans = "Вы Чингизхан"
elif score > 17 and score < 35:
    ans = 'Вы Тесла'
elif score > 36 and score < 52:
    ans = 'Вы Илон Маск'
elif score > 52 and score < 80:
    ans = 'Вы Рокфеллер'
elif score > 80:
    ans = 'Вы Теренс Тао'


if st.button('Нажмите чтоб узнать результат'):
     st.write(ans)



st.caption('Made by Shohin')