from asyncore import write
from uuid import RFC_4122
import streamlit as st

st.title('Барои синфи 11. Саволнома оид ба муайян кардани шавқу рағбат Супордани тест')


st.subheader('Агар ба шумо воқеан он чизе, ки дар савол дода мешавад, маъқул бошад, 1-ро интихоб кунед, агар шумо намедонед, шубҳа дошта бошед - сифр 0, агар ба шумо маъқул набошад -1. Ба саволҳо ҷавоб диҳед, ҳеҷ яке аз онҳоро нодида намонед.')

q1 = st.selectbox(
     'Шиносоӣ бо ҳаёти растаниҳо ва ҳайвонот.',
     (1 , 0, -1))


q2 = st.selectbox(
     'Дарсҳои ҷуғрофия.',
     (1 , 0, -1))


q3 = st.selectbox(
     'Хондани китобҳо дар бораи экспедитсияҳои геологӣ.',
     (1 , 0, -1))




q4 = st.selectbox(
     'Дарсҳои анатомия ва физиологияи инсон.',
     (1 , 0, -1))

q5 = st.selectbox(
     'Дарсҳои рўзгордорӣ ва тарзи тайёр кардани шарбатҳо.',
     (1, 0, -1))

q6 = st.selectbox(
     'Хондани адабиёти илмию оммавӣ дар бораи кашфиётҳои физикӣ.',
     (1, 0, -1))



q7 = st.selectbox(
     'Хондани адабиёти илмию оммавӣ дар бораи кашфиётҳои соҳаи химия.',
     (1, 0, -1))


q8 = st.selectbox(
     'Хондани маҷаллаҳои техникӣ.',
     (1, 0, -1))



q9 = st.selectbox(
     'Хондани мавод дар бораи комёбиҳои соҳаи электротехника.',
     (1, 0, -1))


    
q10 = st.selectbox(
     'Шиносоӣ бо фулузотҳои гуногун.',
     (1, 0, -1))


q11 = st.selectbox(
     'Гирифтани маълумот дар бораи намудҳои гуногуни дарахтҳо ва истифодаи амалии онҳо.',
     (1, 0, -1))


q12 = st.selectbox(
     'Тамошо кардани барномаҳои телевизионӣ дар бораи сохтмон.',
     (1, 0, -1))


q13 = st.selectbox(
     'Майлу рағбат зоҳир намудан ба коркардҳои нав дар соҳаи нақлиёт (автомобилсозӣ, ҳавопаймоӣ, нақлиёти роҳи оҳан ва ғайра).',
     (1, 0, -1))


q14 = st.selectbox(
     'Хондани китобҳо дар бораи лётчикҳо ва космонавтҳо',
     (1, 0, -1))


q15 = st.selectbox(
     'Шиносоӣ бо техникаи харбй',
     (1, 0, -1))


q16 = st.selectbox(
     'Хондани китобҳои таърихӣ.',
     (1, 0, -1))


q17 = st.selectbox(
     'Хондани асарҳои классикони ҷаҳон.',
     (1, 0, -1))


q18 = st.selectbox(
     'Хондани мақолаву очеркҳои  дар маҷаллаву рўзномаҳо чопшуда.',
     (1, 0, -1))


q19 = st.selectbox(
     'Муҳокимаи кору воқеаҳои ҳаррўза дар синфу мактаб.',
     (1, 0, -1))


q20 = st.selectbox(
     'Хондани адабиёт дар бораи кори мураббӣ, муаллим',
     (1, 0, -1))


q21 = st.selectbox(
     'Хондани китобҳо дар бораи кормандони умури дохила.',
     (1, 0, -1))


q22 = st.selectbox(
     'Ғамҳорӣ зоҳир  кардан нисбат ба тартиби чизҳо, зебоии хонае, ки дар он мехонад, кор ва зиндагӣ мекунад.',
     (1, 0, -1))


q23 = st.selectbox(
     'Хондани китобҳо ба монанди «Математикаи шавқовар».',
     (1, 0, -1))


q24 = st.selectbox(
     'Ба масъалаҳои ҷуғрофӣ, иқтисодӣ мароқ зоҳир кардан.',
     (1, 0, -1))


q25 = st.selectbox(
     'Омўзиши забонҳои хориҷӣ (русӣ, англисӣ, фаронсавӣ, олмонӣ ва дигар забонҳо).',
     (1, 0, -1))


q26 = st.selectbox(
     'Шинос шудан ба ҳаёти рассомони машҳур.',
     (1, 0, -1))


q27 = st.selectbox(
     'Шинос шудан ба ҳаёти устодони машҳури саҳна ва кино.',
     (1, 0, -1))


q28 = st.selectbox(
     'Шинос шудан ба ҳаёт ва эҷодиёти мусиқачиёни машҳур.',
     (1, 0, -1))


q29 = st.selectbox(
     'Хондани рўзномаҳои варзишӣ.',
     (1, 0, -1))


q30 = st.selectbox(
     'Омўхтани ботаника, зоология ва биология.',
     (1, 0, -1))


q31 = st.selectbox(
     'Шинос шудан ба мамлакатҳои гуногун аз рўи харитаи ҷуғрофӣ.',
     (1, 0, -1))


q32 = st.selectbox(
     'Хондани адабиётҳо дар бораи ҳаёт ва фаъолияти геологҳои машҳур.',
     (1, 0, -1))


q33 = st.selectbox(
     'Хондан дар бораи он,  ки одамон чӣ тавр ба муқобили касалиҳо мубориза мебаранд.',
     (1, 0, -1))


q34 = st.selectbox(
     'Рафтан ба муассисаҳои давлатӣ ва ғайридавлатӣ, саноати сабук (дўзандагӣ, пойафзолдўзӣ, бофандагӣ ва ғайра).',
     (1, 0, -1))


q35 = st.selectbox(
     'Хондани китобҳо ба монанди «Физикаи шавқовар».',
     (1, 0, -1))


q36 = st.selectbox(
     'Пайдо шудани ҳодисаҳои  химиявӣ дар табиат ва гузаронидани таҷрибаҳо.',
     (1, 0, -1))


q37 = st.selectbox(
     'Шинос шудан ба комёбиҳои техникаи ҳозиразамон.',
     (1, 0, -1))


q38 = st.selectbox(
     'Ширкат варзидан дар маҳфилҳои радиотехника.',
     (1, 0, -1))


q39 = st.selectbox(
     'Шинос шудан ва истифода намудани асбобҳои ченкунӣ дар коркарди чӯб ва металл.',
     (1, 0, -1))


q40 = st.selectbox(
     'Мушоҳида намудан ба истехсоли маснуоти чубу тахта (масалан, мебель).',
     (1, 0, -1))


q41 = st.selectbox(
     'Мушоҳида намудан ба кори сохтмончиён.',
     (1, 0, -1))


q42 = st.selectbox(
     'Шавқу ҳавас зоҳир намудан ба рушди намудҳои гуногуни нақлиёт.',
     (1, 0, -1))


q43 = st.selectbox(
     'Мутолиаи китоб,тамошои сериалҳо ва филмҳо дар бораи баҳрчиён.',
     (1, 0, -1))


q44 = st.selectbox(
     'Хондани китобҳо, тамошои филмҳо дар мавзўъҳои ҳарбӣ.',
     (1, 0, -1))


q45 = st.selectbox(
     'Баррасӣ намудани воқеаҳои сиёси дар дохил ва хориҷи кишвар.',
     (1, 0, -1))


q46 = st.selectbox(
     'Хондани мақолаҳои адабию  танқидӣ.',
     (1, 0, -1))


q47 = st.selectbox(
     'Шунидани ахбороти радио ва телевизион.',
     (1, 0, -1))


q48 = st.selectbox(
     'Мароқ зоҳир кардан ба воқеаҳои таърихие, ки дар ноҳия, шаҳр, Ҷумҳурии Тоҷикистон ва дигар мамолики ҷаҳон ба вуқўъ меоянд.',
     (1, 0, -1))


q49 = st.selectbox(
     'Ба рафиқон фаҳмондани роҳҳои иҷрои супориши таълимӣ дар ҳолате, ки агар худашон онро иҷро карда натавонанд.',
     (1, 0, -1))


q50 = st.selectbox(
     'Таҳлил кардани рафтори қаҳрамонони асар.',
     (1, 0, -1))


q51 = st.selectbox(
     'Таъминоти оила бо хўрокворӣ (ташкил ва ба ҳама тайёр намудани хўрок дар вақти сайёҳат, сафар ва тамошо).',
     (1, 0, -1))


q52 = st.selectbox(
     'Хондани адабиёти илмию оммавӣ дар бораи кашфиётҳои математика.',
     (1, 0, -1))


q53 = st.selectbox(
     'Кор дар соҳаи  иқтисод  ва банақшагирӣ',
     (1, 0, -1))


q54 = st.selectbox(
     'Хондани адабиёти бадеӣ  бо забони хориҷӣ.',
     (1, 0, -1))


q55 = st.selectbox(
     'Машғул шудан ба ороиши бадеии рўзнома.',
     (1, 0, -1))


q56 = st.selectbox(
     'Рафтан ба театри драмавӣ ё театри ҷавон.',
     (1, 0, -1))


q57 = st.selectbox(
     'Шунидани мусиқии операвӣ.',
     (1, 0, -1))


q58 = st.selectbox(
     'Иштирок дар мусобиқаҳои варзишӣ.',
     (1, 0, -1))


q59 = st.selectbox(
     'Иштирок кардан дар маҳфили биологӣ.',
     (1, 0, -1))


q60 = st.selectbox(
     'Машғулият дар маҳфили ҷуғрофӣ.',
     (1, 0, -1))


q61 = st.selectbox(
     'Омўхтани касби геологӣ.',
     (1, 0, -1))


q62 = st.selectbox(
     'Омӯхтани функсияхои организми одам, сабабхо ва усулхои муоличаи касалихои одам.',
     (1, 0, -1))


q63 = st.selectbox(
     'Пухтани хӯроки шом дар хона.',
     (1, 0, -1))


q64 = st.selectbox(
     'Гузаронидани таҷриба аз фанни физика ё электротехника.',
     (1, 0, -1))


q65 = st.selectbox(
     'Тайёр кардани маҳлулҳои химиявӣ.',
     (1, 0, -1))


q66 = st.selectbox(
     'Ба қисмҳо ҷудокунӣ, таъмир, донистани қисмхои механизмҳои гуногун (соат, асбобҳои рўзгор, велосипедҳо) мароқ зоҳир кардан.',
     (1, 0, -1))


q67 = st.selectbox(
     'Гузаронидани ченкуни дар шабакахои электрики ба воситаи асбобхо (волтметр, амперметр).',
     (1, 0, -1))


q68 = st.selectbox(
     'Машғул шудан бо коркард ва тайёр кардани қисмҳои гуногуни деталҳо  ва коркарди чуб.',
     (1, 0, -1))


q69 = st.selectbox(
     'Ба таври бадеӣ коркарди дарахт (буридан).',
     (1, 0, -1))


q70 = st.selectbox(
     'Кашидани нақшаҳо ё сохтани нақшаҳои объектҳои сохтмон.',
     (1, 0, -1))


q71 = st.selectbox(
     'Зоҳир кардани таваҷҷуҳ ба нақлиёти автомобилӣ.',
     (1, 0, -1))


q72 = st.selectbox(
     'Зоҳир кардани таваҷҷуҳ ба парашютронй, моделсозии самолёт.',
     (1, 0, -1))


q73 = st.selectbox(
     'Машҳ кардан ба варзиши тирандозӣ.',
     (1, 0, -1))


q74 = st.selectbox(
     'Омўхтани таърихи пайдоиши халқҳо ва давлатҳои гуногун.',
     (1, 0, -1))
     

q75 = st.selectbox(
     'Навиштани иншои хонагӣ ё синфӣ аз адабиёт.',
     (1, 0, -1))


q76 = st.selectbox(
    'Мушоҳида кардани рафтор, ахлоқ, ҳаёти одамони гуногун.',
    (1, 0, -1))

q77 = st.selectbox(
    'Иҷро кардани кори ташкилотчигии ҷамъиятӣ.',
    (1, 0, -1))

q78 = st.selectbox(
    'Гузаронидани вақт бо хурдсолон (хондани китобҳо, нақл намудан).',
    (1, 0, -1))

q79 = st.selectbox(
    'Ҷорӣ кардани интизом дар байни ҳамсолон ва хурдсолон.',
    (1, 0, -1))

q80 = st.selectbox(
    'Мушоҳида кардани кори фурўшанда, ошпаз, пешхизмат.',
    (1, 0, -1))

q81 = st.selectbox(
    'Машғулият варзидан дар маҳфили математикӣ.',
    (1, 0, -1))

q82 = st.selectbox(
    'Омўхтани масъалаҳои тараққиёти саноат.',
    (1, 0, -1))

q83 = st.selectbox(
    'Сўҳбат кардан бо рафиқон ва шиносоӣ бо забони хориҷӣ.',
    (1, 0, -1))

q84 = st.selectbox(
    'Рафтан ба музейҳо, намоишгоҳҳои бадеӣ.',
    (1, 0, -1))

q85 = st.selectbox(
    'Баромад кардан дар саҳна,  дар назди тамошобинон.',
    (1, 0, -1))

q86 = st.selectbox(
    'Навохтани яке аз асбобҳои мусиқӣ.',
    (1, 0, -1))

q87 = st.selectbox(
    'Ширкат варзидан дар бозиҳои варзишӣ.',
    (1, 0, -1))

q88 = st.selectbox(
    'Парвариши растаниҳо дар боғ, полез ё парвариши ҳайвонот, нигоҳубини онҳо',
    (1, 0, -1))

q89 = st.selectbox(
    'Мустақилона тартиб додани харитаи ҷуғрофӣ.',
    (1, 0, -1))

q90 = st.selectbox(
    'Ташриф ёфтан дар осорхонаи таърихии кишвар.',
    (1, 0, -1))

q91 = st.selectbox(
    'Шиносоӣ бо кори  ҳамшираи шавқат, табиб ё дорусоз.',
    (1, 0, -1))

q92 = st.selectbox(
    'Иштирок дар маҳфили либосбурию дўзандагӣ.',
    (1, 0, -1))

q93 = st.selectbox(
    'Машғулият дар маҳфили физика.',
    (1, 0, -1))

q94 = st.selectbox(
    'Машғулият дар маҳфили кимиёвӣ.',
    (1, 0, -1))

q95 = st.selectbox(
    'Кор бо компютер.',
    (1, 0, -1))

q96 = st.selectbox(
    'Сарфаҳм рафтан ба сохти асбобҳои барқӣ.',
    (1, 0, -1))

q97 = st.selectbox(
    'Машғулият дар устохонаҳои харротии мактаб',
    (1, 0, -1))

q98 = st.selectbox(
    'Иҷро кардани корхои дуредгари.',
    (1, 0, -1))

q99 = st.selectbox(
    'Иштирок кардан дар анчом додани таъмир.',
    (1, 0, -1))

q100 = st.selectbox(
    'Ёрӣ додан дар кори нозирони роҳ.',
    (1, 0, -1))

q101 = st.selectbox(
    'Аъзои шудани клубҳои қаиқронӣ ва яхта.',
    (1, 0, -1))

q102 = st.selectbox(
    'Иштирок кардан дар бозихои харбй.',
    (1, 0, -1))

q103 = st.selectbox(
    'Рафтан ба музейҳои таърихӣ, шиносоӣ бо ёдгориҳои халқӣ.',
    (1, 0, -1))

q104 = st.selectbox(
    'Машғулият дар маҳфили адабӣ аз забон ва адабиёти рус.',
    (1, 0, -1))

q105 = st.selectbox(
    'Тамошо кардани намоишҳои телевизионии рӯзноманигорон.',
    (1, 0, -1))

q106 = st.selectbox(
    'Дар синф баромад кардан бо ахборот оид ба вазъияти байналхалқӣ.',
    (1, 0, -1))

q107 = st.selectbox(
    'Ҳамкорӣ бо бачагони мушкилтарбия.',
    (1, 0, -1))

q108 = st.selectbox(
    'Муайян кардани сабабхои нихонии рафтору рафтори одамон.',
    (1, 0, -1))

q109 = st.selectbox(
    'Хидмат расонидан ба одамони дигар.',
    (1, 0, -1))

q110 = st.selectbox(
    'Ҳал намудани масъалаҳои мураккаби математикӣ.',
    (1, 0, -1))

q111 = st.selectbox(
    'Ҳисобу китоби аниқ аз болои харҷу дахли пулии худ ва иҷро намудани нақши соҳибкор, тоҷир.',
    (1, 0, -1))

q112 = st.selectbox(
    'Машғулият дар маҳфили забони хориҷӣ.',
    (1, 0, -1))

q113 = st.selectbox(
    'Иштирок кардан дар намоишгоҳҳои санъати тасвирӣ.',
    (1, 0, -1))

q114 = st.selectbox(
    'Иштирок кардан дар озмуну маҳфилҳои ҳаваскорони санъати бадеӣ.',
    (1, 0, -1))

q115 = st.selectbox(
    'Машғулият дар хори умумӣ ё  дар ягон маҳфили мусиқӣ.',
    (1, 0, -1))

q116 = st.selectbox(
    'Дар яке аз машғулиятҳои варзишӣ машқ кардан',
    (1, 0, -1))




r1 = q1 + q30 + q59 + q88
r2 = q2 + q31 +  q60 + q89
r3 = q3 + q32 + q61 + q90
r4 = q4 + q33 + q62 + q91
r5 = q5 + q34 + q63 + q92 
r6 = q6 + q35 + q64 + q93
r7 = q7+ q36 + q65 + q94
r8 = q8 + q37 + q66 + q95 
r9 = q9 + q38 + q67 + q96 
r10 = q10 + q39 + q68 + q97 
r11 = q11 + q40 + q69 + q98 
r12 = q12 + q41 + q70 + q99 
r13 = q13 + q42 + q71 + q100 
r14 = q14 + q43 + q72 + q101
r15 = q15 + q44 + q73 + q102
r16 = q16 + q45 + q74 + q103
r17 = q17 + q37 + q66 + q95 
r18 = q18 + q37 + q66 + q95 
r19 = q19 + q37 + q66 + q95 
r20 = q20 + q37 + q66 + q95 
r21 = q21 + q37 + q66 + q95 
r22  = q22 + q37 + q66 + q95 
r23 = q23 + q37 + q66 + q95 
r24 = q24 + q37 + q66 + q95 
r25 = q25 + q37 + q66 + q95 
r26 = q26 + q37 + q66 + q95 
r27 = q27 + q37 + q66 + q95 
r28 = q28 + q37 + q66 + q95 
r29 = q29 + q37 + q66 + q95 


if st.button('Result'):
     if r1 > 2:
         st.write('Ихтисосҳое ки бо биология алоқаманданд дида бароед') 
     if r2 > 2:
         st.write('Ихтисосҳое ки бо география алоқаманданд дида бароед')
     if r3 > 2:
         st.write('Ихтисосҳое ки бо геология алоқаманданд дида бароед')
     if r4 > 2:
         st.write('Ихтисосҳое ки бо тиб алоқаманданд дида бароед')
     if r5 > 2:
         st.write('Ихтисосҳое ки бо саноати сабук ва хӯрокворӣ алоқаманданд дида бароед')
     if r6 > 2:
         st.write('Ихтисосҳое ки бо физика алоқаманданд дида бароед')
     if r7 > 2:
         st.write('Ихтисосҳое ки бо химия алоқаманданд дида бароед')
     if r8 > 2:
         st.write('Ихтисосҳое ки бо техника алоқаманданд дида бароед')
     if r9 > 2:
         st.write('Ихтисосҳое ки бо электротехника алоқаманданд дида бароед')
     if r10 > 2:
         st.write('Ихтисосҳое ки бо коркарди металл алоқаманданд дида бароед')
     if r11 > 2:
         st.write('Ихтисосҳое ки бо коркарди чӯб алоқаманданд дида бароед')
     if r12 > 2:
         st.write('Ихтисосҳое ки бо сохтмон алоқаманданд дида бароед')
     if r13 > 2:
         st.write('Ихтисосҳое ки бо нақлиёт алоқаманданд дида бароед')
     if r14 > 2:
         st.write('Ихтисосҳое ки бо авиатсия ё баҳрӣ алоқаманданд дида бароед')
     if r15 > 2:
         st.write('Ихтисосҳое ки бо ихтисосҳои ҳарбӣ алоқаманданд дида бароед')
     if r16 > 2:
         st.write('Ихтисосҳое ки бо таърих алоқаманданд дида бароед')
     if r17 > 2:
         st.write('Ихтисосҳое ки бо адабиёт алоқаманданд дида бароед')
     if r18 > 2:
         st.write('Ихтисосҳое ки бо журналистика алоқаманданд дида бароед')
     if r19 > 2:
         st.write('Ихтисосҳое ки бо корҳои ҷамъиятӣ алоқаманданд дида бароед')
     if r20 > 2:
         st.write('Ихтисосҳое ки бо педагогика алоқаманданд дида бароед')
     if r21 > 2:
         st.write('Ихтисосҳое ки бо ҳуқуқшинос алоқаманданд дида бароед')
     if r22 > 2:
         st.write('Ихтисосҳое ки бо соҳаи хизматрасонӣ алоқаманданд дида бароед')
     if r23 > 2:
         st.write('Ихтисосҳое ки бо математика алоқаманданд дида бароед')
     if r24 > 2:
         st.write('Ихтисосҳое ки бо экономика алоқаманданд дида бароед')
     if r25 > 2:
         st.write('Ихтисосҳое ки бо забонҳои хариҷӣ алоқаманданд дида бароед')
     if r26 > 2:
         st.write('Ихтисосҳое ки бо санъати тасвирӣ алоқаманданд дида бароед')
     if r27 > 2:
         st.write('Ихтисосҳое ки бо санъати саҳнавӣ алоқаманданд дида бароед')
     if r28 > 2:
         st.write('Ихтисосҳое ки бо мусиқӣ алоқаманданд дида бароед')
     if r29 > 2:
         st.write('Ихтисосҳое ки бо варзиш алоқаманданд дида бароед')
     
